Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX420F032H.atdf
         <module id="00740" name="ICAP" version="">
            <instance name="ICAP1">
               <register-group address-space="periph0" name="ICAP" name-in-module="ICAP" offset="0x1f801ff4" />
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP2">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP3">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP4">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP5">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
         </module>
         <module id="00868" name="INT" version="">
            <instance name="INT">
               <register-group address-space="periph2" name="INT" name-in-module="INT" offset="0x1f881000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00761" name="NVM" version="">
            <instance name="NVM">
               <register-group address-space="periph1" name="NVM" name-in-module="NVM" offset="0x1f80f400" />
               <parameters>
                  <param name="PAGE_SIZE" value="4096"/>
                  <param name="ROW_SIZE" value="512"/>
               </parameters>
            </instance>
         </module>
         <module id="00749" name="OCMP" version="">
            <instance name="OCMP1">
               <register-group address-space="periph0" name="OCMP" name-in-module="OCMP" offset="0x1f802ff4" />
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP2">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP3">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP4">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP5">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
         </module>
         <module id="01095" name="OSC" version="">
            <instance name="OSC">
               <register-group address-space="periph1" name="OSC" name-in-module="OSC" offset="0x1f80f000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00815" name="PCACHE" version="">
            <instance name="PCACHE">
               <register-group address-space="periph2" name="PCACHE" name-in-module="PCACHE" offset="0x1f884000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00751" name="PMP" version="">
            <instance name="PMP">
               <register-group address-space="periph0" name="PMP" name-in-module="PMP" offset="0x1f806ff4" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00868" name="PORT" version="">
            <instance name="PORT">
               <register-group address-space="periph2" name="PORT" name-in-module="PORT" offset="0x1f886040" />
               <parameters>
                  <param name="CN_PIN_COUNT" value="19" />
                  <param name="AN_PIN_COUNT" value="16" />
               </parameters>
            </instance>
         </module>
         <module id="01342" name="RCON" version="">
            <instance name="RCON">
               <register-group address-space="periph1" name="RCON" name-in-module="RCON" offset="0x1f80f600" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00748" name="RTCC" version="">
            <instance name="RTCC">
               <register-group address-space="periph0" name="RTCC" name-in-module="RTCC" offset="0x1f8001f4" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00753" name="SPI" version="">
            <instance name="SPI2">
               <register-group address-space="periph0" name="SPI" name-in-module="SPI" offset="0x1f8059f4" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>

         <module id="00687" name="TMR1" version="">
            <instance name="TMR1">
               <register-group address-space="periph0" name="TMR1" name-in-module="TMR1" offset="0x1f8005f4" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00745" name="TMR" version="">
            <instance name="TMR2">
               <register-group address-space="periph0" name="TMR" name-in-module="TMR" offset="0x1f8007f4" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
