Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX420F032H.atdf
            <instance name="TMR3">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR4">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR5">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00734" name="UART" version="">
            <instance name="UART1">
               <register-group address-space="periph0" name="UART" name-in-module="UART" offset="0x1f805ff4" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="UART2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00951" name="USB" version="">
            <instance name="USB">
               <register-group address-space="periph2" name="USB" name-in-module="USB" offset="0x1f885040" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00781" name="WDT" version="">
            <instance name="WDT">
               <register-group address-space="periph0" name="WDT" name-in-module="WDT" offset="0x1f800000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
      </peripherals>
      <interrupts>
         <Interrupt caption="Core Timer" index="0" irq-caption="Core Timer" irq-index="0" irq-name="CORE_TIMER" name="CORE_TIMER" />
         <Interrupt caption="Core Software 0" index="1" irq-caption="Core Software 0" irq-index="1" irq-name="CORE_SOFTWARE_0" name="CORE_SOFTWARE_0" />
         <Interrupt caption="Core Software 1" index="2" irq-caption="Core Software 1" irq-index="2" irq-name="CORE_SOFTWARE_1" name="CORE_SOFTWARE_1" />
         <Interrupt caption="Ext INT 0" index="3" irq-caption="Ext INT 0" irq-index="3" irq-name="EXTERNAL_0" name="EXTERNAL_0" />
         <Interrupt caption="Ext INT 1" index="7" irq-caption="Ext INT 1" irq-index="7" irq-name="EXTERNAL_1" name="EXTERNAL_1" />
         <Interrupt caption="Ext INT 2" index="11" irq-caption="External INT 2" irq-index="11" irq-name="EXTERNAL_2" name="EXTERNAL_2" />
         <Interrupt caption="Ext INT 3" index="15" irq-caption="Ext INT 3" irq-index="15" irq-name="EXTERNAL_3" name="EXTERNAL_3" />
         <Interrupt caption="Ext INT 4" index="19" irq-caption="Ext INT 4" irq-index="19" irq-name="EXTERNAL_4" name="EXTERNAL_4" />
         <Interrupt caption="Timer1" index="4" irq-caption="Timer 1" irq-index="4" irq-name="TIMER_1" name="TIMER_1" />
         <Interrupt caption="Timer2" index="8" irq-caption="Timer 2" irq-index="8" irq-name="TIMER_2" name="TIMER_2" />
         <Interrupt caption="Timer3" index="12" irq-caption="Timer 3" irq-index="12" irq-name="TIMER_3" name="TIMER_3" />
         <Interrupt caption="Timer4" index="16" irq-caption="Timer 4" irq-index="16" irq-name="TIMER_4" name="TIMER_4" />
         <Interrupt caption="Timer5" index="20" irq-caption="Timer 5" irq-index="20" irq-name="TIMER_5" name="TIMER_5" />
         <Interrupt caption="Change Notice" index="26" irq-caption="Change Notice" irq-index="32" irq-name="CHANGE_NOTICE" name="CHANGE_NOTICE" />
         <Interrupt caption="Input Capture 1" index="5" irq-caption="Input Capture 1" irq-index="5" irq-name="INPUT_CAPTURE_1" name="INPUT_CAPTURE_1" />
         <Interrupt caption="Input Capture 2" index="9" irq-caption="Input Capture 2" irq-index="9" irq-name="INPUT_CAPTURE_2" name="INPUT_CAPTURE_2" />
         <Interrupt caption="Input Capture 3" index="13" irq-caption="Input Capture 3" irq-index="13" irq-name="INPUT_CAPTURE_3" name="INPUT_CAPTURE_3" />
         <Interrupt caption="Input Capture 4" index="17" irq-caption="Input Capture 4" irq-index="17" irq-name="INPUT_CAPTURE_4" name="INPUT_CAPTURE_4" />
         <Interrupt caption="Input Capture 5" index="21" irq-caption="Input Capture 5" irq-index="21" irq-name="INPUT_CAPTURE_5" name="INPUT_CAPTURE_5" />
         <Interrupt caption="Output Compare 1" index="6" irq-caption="Output Compare 1" irq-index="6" irq-name="OUTPUT_COMPARE_1" name="OUTPUT_COMPARE_1" />
         <Interrupt caption="Output Compare 2" index="10" irq-caption="Output Compare 2" irq-index="10" irq-name="OUTPUT_COMPARE_2" name="OUTPUT_COMPARE_2" />
         <Interrupt caption="Output Compare 3" index="14" irq-caption="Output Compare 3" irq-index="14" irq-name="OUTPUT_COMPARE_3" name="OUTPUT_COMPARE_3" />
         <Interrupt caption="Output Compare 4" index="18" irq-caption="Output Compare 4" irq-index="18" irq-name="OUTPUT_COMPARE_4" name="OUTPUT_COMPARE_4" />
         <Interrupt caption="Output Compare 5" index="22" irq-caption="Output Compare 5" irq-index="22" irq-name="OUTPUT_COMPARE_5" name="OUTPUT_COMPARE_5" />
         <Interrupt caption="UART 1" index="24" irq-caption="UART1 Error" irq-index="26" irq-name="UART1_ERR" name="UART_1" />
         <Interrupt caption="UART 1" index="24" irq-caption="UART1 Receiver" irq-index="27" irq-name="UART1_RX" name="UART_1" />
         <Interrupt caption="UART 1" index="24" irq-caption="UART1 Trasmitter" irq-index="28" irq-name="UART1_TX" name="UART_1" />
         <Interrupt caption="I2C 1" index="25" irq-caption="I2C1 Bus Collision Event" irq-index="29" irq-name="I2C1_BUS" name="I2C_1" />
         <Interrupt caption="I2C 1" index="25" irq-caption="I2C1 Slave Event" irq-index="30" irq-name="I2C1_SLAVE" name="I2C_1" />
         <Interrupt caption="I2C 1" index="25" irq-caption="I2C1 Master Event" irq-index="31" irq-name="I2C1_MASTER" name="I2C_1" />
         <Interrupt caption="SPI 2" index="31" irq-caption="SPI2 Error" irq-index="37" irq-name="SPI2_ERR" name="SPI_2" />
         <Interrupt caption="SPI 2" index="31" irq-caption="SPI2 Receiver" irq-index="39" irq-name="SPI2_RX" name="SPI_2" />
         <Interrupt caption="SPI 2" index="31" irq-caption="SPI2 Trasmitter" irq-index="38" irq-name="SPI2_TX" name="SPI_2" />
         <Interrupt caption="UART 2" index="32" irq-caption="UART2 Error" irq-index="40" irq-name="UART2_ERR" name="UART_2" />
         <Interrupt caption="UART 2" index="32" irq-caption="UART2 Receiver" irq-index="41" irq-name="UART2_RX" name="UART_2" />
         <Interrupt caption="UART 2" index="32" irq-caption="UART2 Trasmitter" irq-index="42" irq-name="UART2_TX" name="UART_2" />
         <Interrupt caption="I2C 2" index="33" irq-caption="I2C2 Bus Collision Event" irq-index="43" irq-name="I2C2_BUS" name="I2C_2" />
         <Interrupt caption="I2C 2" index="33" irq-caption="I2C2 Slave Event" irq-index="44" irq-name="I2C2_SLAVE" name="I2C_2" />
         <Interrupt caption="I2C 2" index="33" irq-caption="I2C2 Master Event" irq-index="45" irq-name="I2C2_MASTER" name="I2C_2" />
         <Interrupt caption="Comparator 1" index="29" irq-caption="Comparator 1" irq-index="35" irq-name="COMPARATOR_1" name="COMPARATOR_1" />
         <Interrupt caption="Comparator 2" index="30" irq-caption="Comparator 2" irq-index="36" irq-name="COMPARATOR_2" name="COMPARATOR_2" />
         <Interrupt caption="ADC" index="27" irq-caption="ADC1 Convert Done" irq-index="33" irq-name="ADC" name="ADC" />
         <Interrupt caption="PMP" index="28" irq-caption="Parallel Master Port" irq-index="34" irq-name="PMP" name="PMP" />
         <Interrupt caption="Fail Safe Clock Monitor" index="34" irq-caption="Fail Safe Clock Monitor" irq-index="46" irq-name="FAIL_SAFE_MONITOR" name="FAIL_SAFE_MONITOR" />
         <Interrupt caption="Real Time Clock Calendar" index="35" irq-caption="Real Time Clock Calendar" irq-index="47" irq-name="RTCC" name="RTCC" />
         <Interrupt caption="Flash Control Event" index="44" irq-caption="" irq-index="56" irq-name="FLASH_CONTROL" name="FCE" />
         <Interrupt caption="USB Module 1" index="45" irq-caption="USB" irq-index="57" irq-name="USB" name="USB_1" />
      </interrupts>
      <interfaces>
         <interface name="JTAG" type="samjtag" />
         <interface name="SWD" type="swd" />
      </interfaces>
   </device>
</devices>
<modules>
   <module caption="" id="" name="FUSECONFIG" version="">
      <register-group name="FUSECONFIG">
         <register caption="Device Configuration Word 3" initval="0x0000FFFF" name="DEVCFG3">
            <bitfield caption="UserID" mask="0xffff" name="USERID" values="DEVCFG3__USERID" />
         </register>
         <register caption="Device Configuration Word 2" initval="0xFFF9F9D9" name="DEVCFG2">
            <bitfield caption="PLL Input Divider bits" mask="0x7" name="FPLLIDIV" values="DEVCFG2__FPLLIDIV" />
            <bitfield caption="PLL Multiplier bits" mask="0x70" name="FPLLMUL" values="DEVCFG2__FPLLMUL" />
            <bitfield caption="USB PLL Input Divider bits" mask="0x700" name="UPLLIDIV" values="DEVCFG2__UPLLIDIV" />
            <bitfield caption="USB PLL Enable bit" mask="0x8000" name="UPLLEN" values="DEVCFG2__UPLLEN" />
            <bitfield caption="Default PLL Output Divisor bits" mask="0x70000" name="FPLLODIV" values="DEVCFG2__FPLLODIV" />
         </register>
         <register caption="Device Configuration Word 1" initval="0xFF74CFD9" name="DEVCFG1">
            <bitfield caption="Oscillator Selection bits" mask="0x7" name="FNOSC" values="DEVCFG1__FNOSC" />
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x20" name="FSOSCEN" values="DEVCFG1__FSOSCEN" />
            <bitfield caption="Internal External Switchover bit" mask="0x80" name="IESO" values="DEVCFG1__IESO" />
            <bitfield caption="Primary Oscillator Configuration bits" mask="0x300" name="POSCMOD" values="DEVCFG1__POSCMOD" />
            <bitfield caption="CLKO Enable Configuration bit" mask="0x400" name="OSCIOFNC" values="DEVCFG1__OSCIOFNC" />
            <bitfield caption="Peripheral Bus Clock Divisor Default Value bits" mask="0x3000" name="FPBDIV" values="DEVCFG1__FPBDIV" />
            <bitfield caption="Clock Switching and Monitor Selection Configuration bits" mask="0xc000" name="FCKSM" values="DEVCFG1__FCKSM" />
            <bitfield caption="Watchdog Timer Postscale Select bits" mask="0x1f0000" name="WDTPS" values="DEVCFG1__WDTPS" />
            <bitfield caption="Watchdog Timer Enable bit" mask="0x800000" name="FWDTEN" values="DEVCFG1__FWDTEN" />
         </register>
         <register caption="Device Configuration Word 0" initval="0x7FFFFFFF" name="DEVCFG0">
            <bitfield caption="Background Debugger Enable bits (forced to 11 if code-protect is enabled)" mask="0x3" name="DEBUG" values="DEVCFG0__DEBUG" />
            <bitfield caption="In-Circuit Emulator/Debugger Communication Channel Select bits" mask="0x8" name="ICESEL" values="DEVCFG0__ICESEL" />
            <bitfield caption="Program Flash Write-Protect bits" mask="0xff000" name="PWP" values="DEVCFG0__PWP" />
            <bitfield caption="Boot Flash Write-Protect bit" mask="0x1000000" name="BWP" values="DEVCFG0__BWP" />
            <bitfield caption="Code-Protect bit" mask="0x10000000" name="CP" values="DEVCFG0__CP" />
         </register>
      </register-group>
      <value-group caption="UserID" name="DEVCFG3__USERID">
         <value caption="" name="" />
      </value-group>
      <value-group caption="PLL Input Divider bits" name="DEVCFG2__FPLLIDIV">
         <value caption="1x Divider" name="DIV_1" value="0x0" />
         <value caption="2x Divider" name="DIV_2" value="0x1" />
         <value caption="3x Divider" name="DIV_3" value="0x2" />
         <value caption="4x Divider" name="DIV_4" value="0x3" />
         <value caption="5x Divider" name="DIV_5" value="0x4" />
         <value caption="6x Divider" name="DIV_6" value="0x5" />
         <value caption="10x Divider" name="DIV_10" value="0x6" />
         <value caption="12x Divider" name="DIV_12" value="0x7" />
      </value-group>
      <value-group caption="PLL Multiplier bits" name="DEVCFG2__FPLLMUL">
         <value caption="15x Multiplier" name="MUL_15" value="0x0" />
         <value caption="16x Multiplier" name="MUL_16" value="0x1" />
         <value caption="17x Multiplier" name="MUL_17" value="0x2" />
         <value caption="18x Multiplier" name="MUL_18" value="0x3" />
         <value caption="19x Multiplier" name="MUL_19" value="0x4" />
         <value caption="20x Multiplier" name="MUL_20" value="0x5" />
         <value caption="21x Multiplier" name="MUL_21" value="0x6" />
         <value caption="24x Multiplier" name="MUL_24" value="0x7" />
      </value-group>
      <value-group caption="USB PLL Input Divider bits" name="DEVCFG2__UPLLIDIV">
         <value caption="1x Divider" name="DIV_1" value="0x0" />
         <value caption="2x Divider" name="DIV_2" value="0x1" />
         <value caption="3x Divider" name="DIV_3" value="0x2" />
         <value caption="4x Divider" name="DIV_4" value="0x3" />
         <value caption="5x Divider" name="DIV_5" value="0x4" />
         <value caption="6x Divider" name="DIV_6" value="0x5" />
         <value caption="10x Divider" name="DIV_10" value="0x6" />
         <value caption="12x Divider" name="DIV_12" value="0x7" />
      </value-group>
      <value-group caption="USB PLL Enable bit" name="DEVCFG2__UPLLEN">
         <value caption="Enabled" name="ON" value="0x0" />
         <value caption="Disabled and Bypassed" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Default PLL Output Divisor bits" name="DEVCFG2__FPLLODIV">
         <value caption="PLL Divide by 1" name="DIV_1" value="0x0" />
         <value caption="PLL Divide by 2" name="DIV_2" value="0x1" />
         <value caption="PLL Divide by 4" name="DIV_4" value="0x2" />
         <value caption="PLL Divide by 8" name="DIV_8" value="0x3" />
         <value caption="PLL Divide by 16" name="DIV_16" value="0x4" />
         <value caption="PLL Divide by 32" name="DIV_32" value="0x5" />
         <value caption="PLL Divide by 64" name="DIV_64" value="0x6" />
         <value caption="PLL Divide by 256" name="DIV_256" value="0x7" />
      </value-group>
