Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX420F032H.atdf
      <value-group caption="PLL Lock Status bit" name="OSCCON__LOCK">
         <value caption="PLL module is in lock or PLL module start-up timer is satisfied" name="IN_LOCK" value="0x1" />
         <value caption="PLL module is out of lock" name="OUT_LOCK" value="0x0" />
      </value-group>
      <value-group caption="USB PLL Lock Status bit" name="OSCCON__ULOCK">
         <value caption="Indicates that the USB PLL module is in lock or USB PLL module start-up timer is satisfied" name="IN_LOCK" value="0x1" />
         <value caption="Indicates that the USB PLL module is out of lock or USB PLL module start-up timer is in progress or USB PLL is disabled" name="OUT_LOCK" value="0x0" />
      </value-group>
      <value-group caption="Clock Selection Lock Enable bit" name="OSCCON__CLKLOCK">
         <value caption="(If FCKSM(1:0) is 1x) Clock and PLL selections are locked / (If FCKSM(1:0) is 0x) Clock and PLL selections are never locked and may be modified" name="ON" value="0x1" />
         <value caption="(If FCKSM(1:0) is 1x) Clock and PLL selections are not locked and may be modified / (If FCKSM(1:0) is 0x) Clock and PLL selections are never locked and may be modified" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="New Oscillator Selection bits" name="OSCCON__NOSC">
         <value caption="Internal Fast RC Oscillator (FRC) divided by OSCCON(FRCDIV) bits" name="FRCDIV" value="0x7" />
         <value caption="Internal Fast RC Oscillator (FRC) divided by 16" name="FRCDIV16" value="0x6" />
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="LPRC" value="0x5" />
         <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Primary Oscillator with PLL module (XTPLL/HSPLL/ECPLL)" name="PRIPLL" value="0x3" />
         <value caption="Primary Oscillator (XT/HS/EC)" name="PRI" value="0x2" />
         <value caption="Internal Fast Internal RC Oscillator with PLL module via Postscaler (FRCPLL)" name="FRCPLL" value="0x1" />
         <value caption="Internal Fast Internal RC Oscillator (FRC)" name="FRC" value="0x0" />
      </value-group>
      <value-group caption="Current Oscillator Selection bits" name="OSCCON__COSC">
         <value caption="Internal Fast RC (FRC) Oscillator divided by OSCCON(FRCDIV) bits" name="FRCDIV" value="0x7" />
         <value caption="Internal Fast RC (FRC) Oscillator divided by 16" name="FRCDIV16" value="0x6" />
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="LPRC" value="0x5" />
         <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Primary Oscillator (POSC) with PLL module (XTPLL/HSPLL/ECPLL)" name="POSC_PLL" value="0x3" />
         <value caption="Primary Oscillator (POSC) (XT/HS/EC)" name="POSC" value="0x2" />
         <value caption="Internal Fast RC Oscillator with PLL module via Postscaler (FRCPLL)" name="FRCPLL" value="0x1" />
         <value caption="Internal Fast RC (FRC) Oscillator" name="FRC" value="0x0" />
      </value-group>
      <value-group caption="Phase-Locked Loop (PLL) Multiplier bits" name="OSCCON__PLLMULT">
         <value caption="Clock is multiplied by 24" name="MUL_24" value="0x7" />
         <value caption="Clock is multiplied by 21" name="MUL_21" value="0x6" />
         <value caption="Clock is multiplied by 20" name="MUL_20" value="0x5" />
         <value caption="Clock is multiplied by 19" name="MUL_19" value="0x4" />
         <value caption="Clock is multiplied by 18" name="MUL_18" value="0x3" />
         <value caption="Clock is multiplied by 17" name="MUL_17" value="0x2" />
         <value caption="Clock is multiplied by 16" name="MUL_16" value="0x1" />
         <value caption="Clock is multiplied by 15" name="MUL_15" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus Clock (PBCLK) Divisor bits" name="OSCCON__PBDIV">
         <value caption="PBCLK is SYSCLK divided by 8 (default)" name="DIV_8" value="0x3" />
         <value caption="PBCLK is SYSCLK divided by 4" name="DIV_4" value="0x2" />
         <value caption="PBCLK is SYSCLK divided by 2" name="DIV_2" value="0x1" />
         <value caption="PBCLK is SYSCLK divided by 1" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="Secondary Oscillator (SOSC) Ready Indicator bit" name="OSCCON__SOSCRDY">
         <value caption="Indicates that the Secondary Oscillator is running and is stable" name="READY" value="0x1" />
         <value caption="Secondary Oscillator is still warming up or is turned off" name="NOT_READY" value="0x0" />
      </value-group>
      <value-group caption="Internal Fast RC Oscillator Clock Divider bits" name="OSCCON__FRCDIV">
         <value caption="FRC divided by 256" name="DIV256" value="0x7" />
         <value caption="FRC divided by 64" name="DIV64" value="0x6" />
         <value caption="FRC divided by 32" name="DIV32" value="0x5" />
         <value caption="FRC divided by 16" name="DIV16" value="0x4" />
         <value caption="FRC divided by 8" name="DIV8" value="0x3" />
         <value caption="FRC divided by 4" name="DIV4" value="0x2" />
         <value caption="FRC divided by 2 (default setting)" name="DIV2" value="0x1" />
         <value caption="FRC divided by 1" name="DIV1" value="0x0" />
      </value-group>
      <value-group caption="Output Divider for PLL" name="OSCCON__PLLODIV">
         <value caption="PLL output divided by 256" name="DIV_256" value="0x7" />
         <value caption="PLL output divided by 64" name="DIV_64" value="0x6" />
         <value caption="PLL output divided by 32" name="DIV_32" value="0x5" />
         <value caption="PLL output divided by 16" name="DIV_16" value="0x4" />
         <value caption="PLL output divided by 8" name="DIV_8" value="0x3" />
         <value caption="PLL output divided by 4" name="DIV_4" value="0x2" />
         <value caption="PLL output divided by 2" name="DIV_2" value="0x1" />
         <value caption="PLL output divided by 1" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="FRC Oscillator Tuning bits" name="OSCTUN__TUN">
         <value caption="Center frequency - 12.5%" name="FREQ_MIN" value="0x20" />
         <value caption="Center frequency. Oscillator runs at minimal frequency (8 MHz)" name="FREQ_CENTER" value="0x0" />
         <value caption="Center frequency + 12.5%" name="FREQ_MAX" value="0x1f" />
      </value-group>
   </module>
   <module caption="" id="00815" name="PCACHE" version="1">
      <register-group name="PCACHE">
         <register caption="Cache Control Register" name="CHECON" offset="0x0" rw="RW" size="4">
            <bitfield caption="PFM Access Time Defined in Terms of SYSLK Wait States bits" mask="0x00000007" name="PFMWS" values="CHECON__PFMWS" />
            <bitfield caption="Predictive Prefetch Enable bits" mask="0x00000030" name="PREFEN" values="CHECON__PREFEN" />
            <bitfield caption="Data Cache Size in Lines bits" mask="0x00000300" name="DCSZ" values="CHECON__DCSZ" />
            <bitfield caption="Cache Coherency Setting on a PFM Program Cycle bit" mask="0x00010000" name="CHECOH" values="CHECON__CHECOH" />
         </register>
         <register caption="Cache Access Register" name="CHEACC" offset="0x10" rw="RW" size="4">
            <bitfield caption="Cache Line Index bits" mask="0x0000000F" name="CHEIDX" values="CHEACC__CHEIDX" />
            <bitfield caption="Cache Access Enable bits for registers CHETAG" mask="0x80000000" name="CHEWEN" values="CHEACC__CHEWEN" />
         </register>
         <register caption="Cache TAG Register" name="CHETAG" offset="0x20" rw="RW" size="4">
            <bitfield caption="Line Type bit" mask="0x00000002" name="LTYPE" values="CHETAG__LTYPE" />
            <bitfield caption="Line Lock bit" mask="0x00000004" name="LLOCK" values="CHETAG__LLOCK" />
            <bitfield caption="Line Valid bit" mask="0x00000008" name="LVALID" values="CHETAG__LVALID" />
            <bitfield mask="0x00FFFFF0" name="LTAG" />
            <bitfield caption="Line TAG Address Boot bit" mask="0x80000000" name="LTAGBOOT" values="CHETAG__LTAGBOOT" />
         </register>
         <register caption="Cache TAG Mask Register" name="CHEMSK" offset="0x30" rw="RW" size="4">
            <bitfield caption="Line Mask bits" mask="0x0000FFE0" name="LMASK" values="CHEMSK__LMASK" />
         </register>
         <register caption="Cache Word 0" name="CHEW0" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEW0" />
         </register>
         <register caption="Cache Word 1" name="CHEW1" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEW1" />
         </register>
