Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX420F032H.atdf
         <register caption="" name="PORTG" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x00000001" name="PORTG" />
            <bitfield mask="0x00000002" name="PORTG" />
            <bitfield mask="0x00000004" name="PORTG" />
            <bitfield mask="0x00000008" name="PORTG" />
            <bitfield mask="0x00000010" name="PORTG" />
            <bitfield mask="0x00000020" name="PORTG" />
            <bitfield mask="0x00000040" name="PORTG" />
            <bitfield mask="0x00000080" name="PORTG" />
            <bitfield mask="0x00000100" name="PORTG" />
            <bitfield mask="0x00000200" name="PORTG" />
            <bitfield mask="0x00000400" name="PORTG" />
            <bitfield mask="0x00000800" name="PORTG" />
            <bitfield mask="0x00001000" name="PORTG" />
            <bitfield mask="0x00002000" name="PORTG" />
            <bitfield mask="0x00004000" name="PORTG" />
            <bitfield mask="0x00008000" name="PORTG" />
         </register>
         <register caption="" name="LATB" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATB" />
            <bitfield mask="0x00000002" name="LATB" />
            <bitfield mask="0x00000004" name="LATB" />
            <bitfield mask="0x00000008" name="LATB" />
            <bitfield mask="0x00000010" name="LATB" />
            <bitfield mask="0x00000020" name="LATB" />
            <bitfield mask="0x00000040" name="LATB" />
            <bitfield mask="0x00000080" name="LATB" />
            <bitfield mask="0x00000100" name="LATB" />
            <bitfield mask="0x00000200" name="LATB" />
            <bitfield mask="0x00000400" name="LATB" />
            <bitfield mask="0x00000800" name="LATB" />
            <bitfield mask="0x00001000" name="LATB" />
            <bitfield mask="0x00002000" name="LATB" />
            <bitfield mask="0x00004000" name="LATB" />
            <bitfield mask="0x00008000" name="LATB" />
         </register>
         <register caption="" name="LATC" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATC" />
            <bitfield mask="0x00000002" name="LATC" />
            <bitfield mask="0x00000004" name="LATC" />
            <bitfield mask="0x00000008" name="LATC" />
            <bitfield mask="0x00000010" name="LATC" />
            <bitfield mask="0x00000020" name="LATC" />
            <bitfield mask="0x00000040" name="LATC" />
            <bitfield mask="0x00000080" name="LATC" />
            <bitfield mask="0x00000100" name="LATC" />
            <bitfield mask="0x00000200" name="LATC" />
            <bitfield mask="0x00000400" name="LATC" />
            <bitfield mask="0x00000800" name="LATC" />
            <bitfield mask="0x00001000" name="LATC" />
            <bitfield mask="0x00002000" name="LATC" />
            <bitfield mask="0x00004000" name="LATC" />
            <bitfield mask="0x00008000" name="LATC" />
         </register>
         <register caption="" name="LATD" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATD" />
            <bitfield mask="0x00000002" name="LATD" />
            <bitfield mask="0x00000004" name="LATD" />
            <bitfield mask="0x00000008" name="LATD" />
            <bitfield mask="0x00000010" name="LATD" />
            <bitfield mask="0x00000020" name="LATD" />
            <bitfield mask="0x00000040" name="LATD" />
            <bitfield mask="0x00000080" name="LATD" />
            <bitfield mask="0x00000100" name="LATD" />
            <bitfield mask="0x00000200" name="LATD" />
            <bitfield mask="0x00000400" name="LATD" />
            <bitfield mask="0x00000800" name="LATD" />
            <bitfield mask="0x00001000" name="LATD" />
            <bitfield mask="0x00002000" name="LATD" />
            <bitfield mask="0x00004000" name="LATD" />
            <bitfield mask="0x00008000" name="LATD" />
         </register>
         <register caption="" name="LATE" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATE" />
            <bitfield mask="0x00000002" name="LATE" />
            <bitfield mask="0x00000004" name="LATE" />
            <bitfield mask="0x00000008" name="LATE" />
            <bitfield mask="0x00000010" name="LATE" />
            <bitfield mask="0x00000020" name="LATE" />
            <bitfield mask="0x00000040" name="LATE" />
            <bitfield mask="0x00000080" name="LATE" />
            <bitfield mask="0x00000100" name="LATE" />
            <bitfield mask="0x00000200" name="LATE" />
            <bitfield mask="0x00000400" name="LATE" />
            <bitfield mask="0x00000800" name="LATE" />
            <bitfield mask="0x00001000" name="LATE" />
            <bitfield mask="0x00002000" name="LATE" />
            <bitfield mask="0x00004000" name="LATE" />
            <bitfield mask="0x00008000" name="LATE" />
         </register>
         <register caption="" name="LATF" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATF" />
            <bitfield mask="0x00000002" name="LATF" />
            <bitfield mask="0x00000004" name="LATF" />
            <bitfield mask="0x00000008" name="LATF" />
            <bitfield mask="0x00000010" name="LATF" />
            <bitfield mask="0x00000020" name="LATF" />
            <bitfield mask="0x00000040" name="LATF" />
            <bitfield mask="0x00000080" name="LATF" />
            <bitfield mask="0x00000100" name="LATF" />
            <bitfield mask="0x00000200" name="LATF" />
            <bitfield mask="0x00000400" name="LATF" />
            <bitfield mask="0x00000800" name="LATF" />
            <bitfield mask="0x00001000" name="LATF" />
            <bitfield mask="0x00002000" name="LATF" />
            <bitfield mask="0x00004000" name="LATF" />
            <bitfield mask="0x00008000" name="LATF" />
         </register>
         <register caption="" name="LATG" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATG" />
            <bitfield mask="0x00000002" name="LATG" />
            <bitfield mask="0x00000004" name="LATG" />
            <bitfield mask="0x00000008" name="LATG" />
            <bitfield mask="0x00000010" name="LATG" />
            <bitfield mask="0x00000020" name="LATG" />
            <bitfield mask="0x00000040" name="LATG" />
            <bitfield mask="0x00000080" name="LATG" />
            <bitfield mask="0x00000100" name="LATG" />
            <bitfield mask="0x00000200" name="LATG" />
            <bitfield mask="0x00000400" name="LATG" />
            <bitfield mask="0x00000800" name="LATG" />
            <bitfield mask="0x00001000" name="LATG" />
            <bitfield mask="0x00002000" name="LATG" />
            <bitfield mask="0x00004000" name="LATG" />
            <bitfield mask="0x00008000" name="LATG" />
         </register>
         <register caption="" name="ODCB" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCB" />
            <bitfield mask="0x00000002" name="ODCB" />
            <bitfield mask="0x00000004" name="ODCB" />
            <bitfield mask="0x00000008" name="ODCB" />
            <bitfield mask="0x00000010" name="ODCB" />
            <bitfield mask="0x00000020" name="ODCB" />
            <bitfield mask="0x00000040" name="ODCB" />
            <bitfield mask="0x00000080" name="ODCB" />
            <bitfield mask="0x00000100" name="ODCB" />
            <bitfield mask="0x00000200" name="ODCB" />
            <bitfield mask="0x00000400" name="ODCB" />
            <bitfield mask="0x00000800" name="ODCB" />
            <bitfield mask="0x00001000" name="ODCB" />
            <bitfield mask="0x00002000" name="ODCB" />
            <bitfield mask="0x00004000" name="ODCB" />
            <bitfield mask="0x00008000" name="ODCB" />
         </register>
         <register caption="" name="ODCC" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCC" />
            <bitfield mask="0x00000002" name="ODCC" />
            <bitfield mask="0x00000004" name="ODCC" />
            <bitfield mask="0x00000008" name="ODCC" />
            <bitfield mask="0x00000010" name="ODCC" />
            <bitfield mask="0x00000020" name="ODCC" />
            <bitfield mask="0x00000040" name="ODCC" />
            <bitfield mask="0x00000080" name="ODCC" />
            <bitfield mask="0x00000100" name="ODCC" />
            <bitfield mask="0x00000200" name="ODCC" />
            <bitfield mask="0x00000400" name="ODCC" />
            <bitfield mask="0x00000800" name="ODCC" />
            <bitfield mask="0x00001000" name="ODCC" />
            <bitfield mask="0x00002000" name="ODCC" />
            <bitfield mask="0x00004000" name="ODCC" />
            <bitfield mask="0x00008000" name="ODCC" />
         </register>
         <register caption="" name="ODCD" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCD" />
            <bitfield mask="0x00000002" name="ODCD" />
            <bitfield mask="0x00000004" name="ODCD" />
            <bitfield mask="0x00000008" name="ODCD" />
            <bitfield mask="0x00000010" name="ODCD" />
            <bitfield mask="0x00000020" name="ODCD" />
            <bitfield mask="0x00000040" name="ODCD" />
            <bitfield mask="0x00000080" name="ODCD" />
            <bitfield mask="0x00000100" name="ODCD" />
            <bitfield mask="0x00000200" name="ODCD" />
            <bitfield mask="0x00000400" name="ODCD" />
            <bitfield mask="0x00000800" name="ODCD" />
            <bitfield mask="0x00001000" name="ODCD" />
            <bitfield mask="0x00002000" name="ODCD" />
            <bitfield mask="0x00004000" name="ODCD" />
            <bitfield mask="0x00008000" name="ODCD" />
         </register>
